#include<reg52.h> // ดึง library เพื่อใช้ควบคุม 8051

sfr CKCON = 0x8F; // กำหนดตัวแปรชื่อ CKCON เพื่อใช้ปรับความถี่ clock

sbit P0_0 = P0^0; // ประกาศตัวแปร P0_0 เท่ากับ port p0.0
sbit P0_1 = P0^1; // ประกาศตัวแปร P0_1 เท่ากับ port p0.1
sbit P0_2 = P0^2; // ประกาศตัวแปร P0_2 เท่ากับ port p0.2
sbit P0_3 = P0^3; // ประกาศตัวแปร P0_3 เท่ากับ port p0.3
sbit P0_4 = P0^4; // ประกาศตัวแปร P0_4 เท่ากับ port p0.4
sbit P0_5 = P0^5; // ประกาศตัวแปร P0_5 เท่ากับ port p0.5
sbit P0_6 = P0^6; // ประกาศตัวแปร P0_6 เท่ากับ port p0.6
sbit P0_7 = P0^7; // ประกาศตัวแปร P0_7 เท่ากับ port p0.7

sbit P2_0 = P2^0; // ประกาศตัวแปร P2_0 เท่ากับ port p2.0
sbit P2_1 = P2^1; // ประกาศตัวแปร P2_1 เท่ากับ port p2.1
sbit P2_2 = P2^2; // ประกาศตัวแปร P2_2 เท่ากับ port p2.2
sbit P2_3 = P2^3; // ประกาศตัวแปร P2_3 เท่ากับ port p2.3
sbit P2_4 = P2^4; // ประกาศตัวแปร P2_4 เท่ากับ port p2.4
sbit P2_5 = P2^5; // ประกาศตัวแปร P2_5 เท่ากับ port p2.5
sbit P2_6 = P2^6; // ประกาศตัวแปร P2_6 เท่ากับ port p2.6
sbit P2_7 = P2^7; // ประกาศตัวแปร P2_7 เท่ากับ port p2.7

void delay(unsigned long); // ประกาศ prototype function

void main(){ // ฟังก์ชันหลัก
	CKCON = 0x01; // ตั้งค่าความถี่ clock ให้มีค่ามากกว่าปกติ 2 เท่า (58.9824)
	
	P2 = 0x00; // เซ็ต port P2 ให้เท่ากับ 0 ทุกบิต
	
	while (1){ // infinite loop
		P2_0 = !P0_0; // กำหนดให้ตัวแปร P2_0 เท่ากับ not P0_0
		P2_1 = !P0_1; // กำหนดให้ตัวแปร P2_1 เท่ากับ not P0_1
		P2_2 = !P0_2; // กำหนดให้ตัวแปร P2_2 เท่ากับ not P0_2
		P2_3 = !P0_3; // กำหนดให้ตัวแปร P2_3 เท่ากับ not P0_3
		P2_4 = !P0_4; // กำหนดให้ตัวแปร P2_4 เท่ากับ not P0_4
		P2_5 = !P0_5; // กำหนดให้ตัวแปร P2_5 เท่ากับ not P0_5
		P2_6 = !P0_6; // กำหนดให้ตัวแปร P2_6 เท่ากับ not P0_6
		P2_7 = !P0_7; // กำหนดให้ตัวแปร P2_7 เท่ากับ not P0_7
	}
}

void delay(unsigned long i){ // ฟังก์ชั่น delay
	while (i>0){i--;} // วนลูปจนกว่าค่า i จะเท่ากับ 0
	return ; // ไม่ return ค่าอะไรกลับไป
}